openxc/vi-firmware/cantranslator/libs/CDL/LPC177x_8xLib/src/lpc177x_8x_gpio.c
/**********************************************************************
* $Id$		lpc177x_8x_gpio.c			2011-06-02
*//**
* @file		lpc177x_8x_gpio.c
* @brief	Contains all functions support for GPIO firmware library
*			on LPC177x_8x
* @version	1.0
* @date		02. June. 2011
* @author	NXP MCU SW Application Team
* 
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors'
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.
**********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup GPIO
 * @{
 */
#ifdef __BUILD_WITH_EXAMPLE__
#include "lpc177x_8x_libcfg.h"
#else
#include "lpc177x_8x_libcfg_default.h"
#endif /* __BUILD_WITH_EXAMPLE__ */
#ifdef _GPIO

/* Includes ------------------------------------------------------------------- */
#include "lpc177x_8x_gpio.h"
#include "lpc177x_8x_clkpwr.h"

/* definitions ------------------------------------------------------------------- */
#define  GPIO_IS_ENABLED(x)    (((x) != 0)? ENABLE:DISABLE)

/* Private Functions ---------------------------------------------------------- */

static LPC_GPIO_TypeDef *GPIO_GetPointer(uint8_t portNum);
static GPIO_HalfWord_TypeDef *FIO_HalfWordGetPointer(uint8_t portNum);
static GPIO_Byte_TypeDef *FIO_ByteGetPointer(uint8_t portNum);

/*********************************************************************//**
 * @brief		Get pointer to GPIO peripheral due to GPIO port
 * @param[in]	portNum		Port Number value, should be in range from 0 to 4.
 * @return		Pointer to GPIO peripheral
 **********************************************************************/
static LPC_GPIO_TypeDef *GPIO_GetPointer(uint8_t portNum)
{
	LPC_GPIO_TypeDef *pGPIO = NULL;

	switch (portNum)
	{
		case 0:
			pGPIO = LPC_GPIO0;
			break;

		case 1:
			pGPIO = LPC_GPIO1;
			break;

		case 2:
			pGPIO = LPC_GPIO2;
			break;

		case 3:
			pGPIO = LPC_GPIO3;
			break;

		case 4:
			pGPIO = LPC_GPIO4;
			break;

		case 5:
			pGPIO = LPC_GPIO5;
			break;

		default:
			break;
	}

	return pGPIO;
}

/*********************************************************************//**
 * @brief		Get pointer to FIO peripheral in halfword accessible style
 * 				due to FIO port
 * @param[in]	portNum		Port Number value, should be in range from 0 to 4.
 * @return		Pointer to FIO peripheral
 **********************************************************************/
static GPIO_HalfWord_TypeDef *FIO_HalfWordGetPointer(uint8_t portNum)
{
	GPIO_HalfWord_TypeDef *pFIO = NULL;

	switch (portNum)
	{
		case 0:
			pFIO = GPIO0_HalfWord;
			break;

		case 1:
			pFIO = GPIO1_HalfWord;
			break;

		case 2:
			pFIO = GPIO2_HalfWord;
			break;

		case 3:
			pFIO = GPIO3_HalfWord;
			break;

		case 4:
			pFIO = GPIO4_HalfWord;
			break;

		case 5:
			pFIO = GPIO5_HalfWord;
			break;

		default:
			break;
	}

	return pFIO;
}

/*********************************************************************//**
 * @brief		Get pointer to FIO peripheral in byte accessible style
 * 				due to FIO port
 * @param[in]	portNum		Port Number value, should be in range from 0 to 4.
 * @return		Pointer to FIO peripheral
 **********************************************************************/
static GPIO_Byte_TypeDef *FIO_ByteGetPointer(uint8_t portNum)
{
	GPIO_Byte_TypeDef *pFIO = NULL;

	switch (portNum)
	{
		case 0:
			pFIO = GPIO0_Byte;
			break;

		case 1:
			pFIO = GPIO1_Byte;
			break;

		case 2:
			pFIO = GPIO2_Byte;
			break;

		case 3:
			pFIO = GPIO3_Byte;
			break;

		case 4:
			pFIO = GPIO4_Byte;
			break;

		case 5:
			pFIO = GPIO5_Byte;
			break;

		default:
			break;
	}

	return pFIO;
}

/* End of Private Functions --------------------------------------------------- */


/* Public Functions ----------------------------------------------------------- */
/** @addtogroup GPIO_Public_Functions
 * @{
 */


/* GPIO ------------------------------------------------------------------------------ */

/*********************************************************************//**
 * @brief		Initialize the GPIO component by power on the clock 
 *				supplied to it.
 * @return		None
 *
 * Note: 
 **********************************************************************/
void GPIO_Init(void)
{
	CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCGPIO, ENABLE);

	return;
}


/*********************************************************************//**
 * @brief		De-initialize the GPIO component by power off the clock 
 *				supplied to it.
 * @return		None
 *
 * Note: 
 **********************************************************************/
void GPIO_Deinit(void)
{
	CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCGPIO, DISABLE);

	return;
}


/*********************************************************************//**
 * @brief		Set Direction for GPIO port.
 * @param[in]	portNum		Port Number value, should be in range from 0 to 4
 * @param[in]	bitValue	Value that contains all bits to set direction,
 * 							in range from 0 to 0xFFFFFFFF.
 * 							example: value 0x5 to set direction for bit 0 and bit 1.
 * @param[in]	dir			Direction value, should be:
 * 							- 0: Input.
 * 							- 1: Output.
 * @return		None
 *
 * Note: All remaining bits that are not activated in bitValue (value '0')
 * will not be effected by this function.
 **********************************************************************/
void GPIO_SetDir(uint8_t portNum, uint32_t bitValue, uint8_t dir)
{
	LPC_GPIO_TypeDef *pGPIO = GPIO_GetPointer(portNum);

	if (pGPIO != NULL)
	{
		// Enable Output
		if (dir)
		{
			pGPIO->DIR |= bitValue;
		}
		// Enable Input
		else
		{
			pGPIO->DIR &= ~bitValue;
		}
	}
}


/*********************************************************************//**
 * @brief		Set Value for bits that have output direction on GPIO port.
 * @param[in]	portNum		Port number value, should be in range from 0 to 4
 * @param[in]	bitValue	Value that contains all bits on GPIO to set,
 * 							in range from 0 to 0xFFFFFFFF.
 * 							example: value 0x5 to set bit 0 and bit 1.
 * @return		None
 *
 * Note:
 * - For all bits that has been set as input direction, this function will
 * not effect.
 * - For all remaining bits that are not activated in bitValue (value '0')
 * will not be effected by this function.
 **********************************************************************/
void GPIO_SetValue(uint8_t portNum, uint32_t bitValue)
{
	LPC_GPIO_TypeDef *pGPIO = GPIO_GetPointer(portNum);

	if (pGPIO != NULL)
	{
		pGPIO->SET = bitValue;
	}
}

/*********************************************************************//**
 * @brief		Clear Value for bits that have output direction on GPIO port.
 * @param[in]	portNum		Port number value, should be in range from 0 to 4
 * @param[in]	bitValue	Value that contains all bits on GPIO to clear,
 * 							in range from 0 to 0xFFFFFFFF.
 * 							example: value 0x5 to clear bit 0 and bit 1.
 * @return		None
 *
 * Note:
 * - For all bits that has been set as input direction, this function will
 * not effect.
 * - For all remaining bits that are not activated in bitValue (value '0')
 * will not be effected by this function.
 **********************************************************************/
void GPIO_ClearValue(uint8_t portNum, uint32_t bitValue)
{
	LPC_GPIO_TypeDef *pGPIO = GPIO_GetPointer(portNum);

	if (pGPIO != NULL)
	{
		pGPIO->CLR = bitValue;
	}
}

/*********************************************************************//**
 * @brief		Output to the GPIO pin an expected value
 * @param[in]	portNum		Port number value, should be in range from 0 to 4
 * @param[in]	bitValue	Value that contains all bits on GPIO to clear,
 * 							in range from 0 to 0xFFFFFFFF.
 * 							example: value 0x5 to clear bit 0 and bit 1.
 * @return		None
 *
 * Note:
 * - For all bits that has been set as input direction, this function will
 * not effect.
 * - For all remaining bits that are not activated in bitValue (value '0')
 * will not be effected by this function.
 **********************************************************************/
void GPIO_OutputValue(uint8_t portNum, uint32_t bitMask, uint8_t value)
{
	if (value == 0)
	{
		GPIO_ClearValue(portNum, bitMask);
	}
	else
	{
		GPIO_SetValue(portNum, bitMask);
	}

